YueDaoWenzz/PMSM-HallFOC/XMC4700HallFOC/MCUInit/gpio_xmc1300_tssop38.h
#ifndef __GPIO_H__
#define __GPIO_H__

/* Generated for XMC1300_TSSOP38 on: Wed Feb  7 12:48:22 2013*/

#include <XMC1300.h>

#define INPUT           0x00U
#define INPUT_PD        0x08U
#define INPUT_PU        0x10U
#define INPUT_PPS       0x18U
#define INPUT_INV       0x20U
#define INPUT_INV_PD    0x28U
#define INPUT_INV_PU    0x30U
#define INPUT_INV_PPS   0x38U
#define OUTPUT_PP_GP    0x80U
#define OUTPUT_PP_AF1   0x88U
#define OUTPUT_PP_AF2   0x90U
#define OUTPUT_PP_AF3   0x98U
#define OUTPUT_PP_AF4   0xA0U
#define OUTPUT_PP_AF5   0xA8U
#define OUTPUT_PP_AF6   0xB0U
#define OUTPUT_PP_AF7   0xB8U
#define OUTPUT_OD_GP    0xC0U
#define OUTPUT_OD_AF1   0xC8U
#define OUTPUT_OD_AF2   0xD0U
#define OUTPUT_OD_AF3   0xD8U
#define OUTPUT_OD_AF4   0XE0U
#define OUTPUT_OD_AF5   0xE8U
#define OUTPUT_OD_AF6   0xF0U
#define OUTPUT_OD_AF7   0XF8U

#define SOFTWARE        0x0UL
#define HW0             0x1UL
#define HW1             0x2UL

__STATIC_INLINE void P0_0_set_mode(uint8_t mode){
    PORT0->IOCR0 &= ~0x000000f8UL;
    PORT0->IOCR0 |= mode << 0;
}

__STATIC_INLINE void P0_0_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00000003UL;
    PORT0->HWSEL |= config << 0;
}

__STATIC_INLINE void P0_0_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00000004UL;
}

__STATIC_INLINE void P0_0_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00000004UL;
}

__STATIC_INLINE void P0_0_set(void){
    PORT0->OMR = 0x00000001UL;
}

__STATIC_INLINE void P0_0_reset(void){
    PORT0->OMR = 0x00010000UL;
}

__STATIC_INLINE void P0_0_toggle(void){
    PORT0->OMR = 0x00010001UL;
}

__STATIC_INLINE uint32_t P0_0_read(void){
    return(PORT0->IN & 0x00000001UL);
}

__STATIC_INLINE void P0_0_enable_pps(void){
    PORT0->PPS |= 0x00000001UL;
}

__STATIC_INLINE void P0_0_disable_pps(void){
    PORT0->PPS &= ~0x00000001UL;
}

__STATIC_INLINE void P0_1_set_mode(uint8_t mode){
    PORT0->IOCR0 &= ~0x0000f800UL;
    PORT0->IOCR0 |= mode << 8;
}

__STATIC_INLINE void P0_1_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x0000000cUL;
    PORT0->HWSEL |= config << 2;
}

__STATIC_INLINE void P0_1_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00000040UL;
}

__STATIC_INLINE void P0_1_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00000040UL;
}

__STATIC_INLINE void P0_1_set(void){
    PORT0->OMR = 0x00000002UL;
}

__STATIC_INLINE void P0_1_reset(void){
    PORT0->OMR = 0x00020000UL;
}

__STATIC_INLINE void P0_1_toggle(void){
    PORT0->OMR = 0x00020002UL;
}

__STATIC_INLINE uint32_t P0_1_read(void){
    return(PORT0->IN & 0x00000002UL);
}

__STATIC_INLINE void P0_1_enable_pps(void){
    PORT0->PPS |= 0x00000002UL;
}

__STATIC_INLINE void P0_1_disable_pps(void){
    PORT0->PPS &= ~0x00000002UL;
}

__STATIC_INLINE void P0_2_set_mode(uint8_t mode){
    PORT0->IOCR0 &= ~0x00f80000UL;
    PORT0->IOCR0 |= mode << 16;
}

__STATIC_INLINE void P0_2_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00000030UL;
    PORT0->HWSEL |= config << 4;
}

__STATIC_INLINE void P0_2_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00000400UL;
}

__STATIC_INLINE void P0_2_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00000400UL;
}

__STATIC_INLINE void P0_2_set(void){
    PORT0->OMR = 0x00000004UL;
}

__STATIC_INLINE void P0_2_reset(void){
    PORT0->OMR = 0x00040000UL;
}

__STATIC_INLINE void P0_2_toggle(void){
    PORT0->OMR = 0x00040004UL;
}

__STATIC_INLINE uint32_t P0_2_read(void){
    return(PORT0->IN & 0x00000004UL);
}

__STATIC_INLINE void P0_2_enable_pps(void){
    PORT0->PPS |= 0x00000004UL;
}

__STATIC_INLINE void P0_2_disable_pps(void){
    PORT0->PPS &= ~0x00000004UL;
}

__STATIC_INLINE void P0_3_set_mode(uint8_t mode){
    PORT0->IOCR0 &= ~0xf8000000UL;
    PORT0->IOCR0 |= mode << 24;
}

__STATIC_INLINE void P0_3_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x000000c0UL;
    PORT0->HWSEL |= config << 6;
}

__STATIC_INLINE void P0_3_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00004000UL;
}

__STATIC_INLINE void P0_3_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00004000UL;
}

__STATIC_INLINE void P0_3_set(void){
    PORT0->OMR = 0x00000008UL;
}

__STATIC_INLINE void P0_3_reset(void){
    PORT0->OMR = 0x00080000UL;
}

__STATIC_INLINE void P0_3_toggle(void){
    PORT0->OMR = 0x00080008UL;
}

__STATIC_INLINE uint32_t P0_3_read(void){
    return(PORT0->IN & 0x00000008UL);
}

__STATIC_INLINE void P0_3_enable_pps(void){
    PORT0->PPS |= 0x00000008UL;
}

__STATIC_INLINE void P0_3_disable_pps(void){
    PORT0->PPS &= ~0x00000008UL;
}

__STATIC_INLINE void P0_4_set_mode(uint8_t mode){
    PORT0->IOCR4 &= ~0x000000f8UL;
    PORT0->IOCR4 |= mode << 0;
}

__STATIC_INLINE void P0_4_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00000300UL;
    PORT0->HWSEL |= config << 8;
}

__STATIC_INLINE void P0_4_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00040000UL;
}

__STATIC_INLINE void P0_4_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00040000UL;
}

__STATIC_INLINE void P0_4_set(void){
    PORT0->OMR = 0x00000010UL;
}

__STATIC_INLINE void P0_4_reset(void){
    PORT0->OMR = 0x00100000UL;
}

__STATIC_INLINE void P0_4_toggle(void){
    PORT0->OMR = 0x00100010UL;
}

__STATIC_INLINE uint32_t P0_4_read(void){
    return(PORT0->IN & 0x00000010UL);
}

__STATIC_INLINE void P0_4_enable_pps(void){
    PORT0->PPS |= 0x00000010UL;
}

__STATIC_INLINE void P0_4_disable_pps(void){
    PORT0->PPS &= ~0x00000010UL;
}

__STATIC_INLINE void P0_5_set_mode(uint8_t mode){
    PORT0->IOCR4 &= ~0x0000f800UL;
    PORT0->IOCR4 |= mode << 8;
}

__STATIC_INLINE void P0_5_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00000c00UL;
    PORT0->HWSEL |= config << 10;
}

__STATIC_INLINE void P0_5_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x00400000UL;
}

__STATIC_INLINE void P0_5_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x00400000UL;
}

__STATIC_INLINE void P0_5_set(void){
    PORT0->OMR = 0x00000020UL;
}

__STATIC_INLINE void P0_5_reset(void){
    PORT0->OMR = 0x00200000UL;
}

__STATIC_INLINE void P0_5_toggle(void){
    PORT0->OMR = 0x00200020UL;
}

__STATIC_INLINE uint32_t P0_5_read(void){
    return(PORT0->IN & 0x00000020UL);
}

__STATIC_INLINE void P0_5_enable_pps(void){
    PORT0->PPS |= 0x00000020UL;
}

