YueDaoWenzz/PMSM-HallFOC/XMC4700HallFOC/MCUInit/gpio_xmc1300_tssop38.h
__STATIC_INLINE void P0_5_disable_pps(void){
    PORT0->PPS &= ~0x00000020UL;
}

__STATIC_INLINE void P0_6_set_mode(uint8_t mode){
    PORT0->IOCR4 &= ~0x00f80000UL;
    PORT0->IOCR4 |= mode << 16;
}

__STATIC_INLINE void P0_6_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00003000UL;
    PORT0->HWSEL |= config << 12;
}

__STATIC_INLINE void P0_6_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x04000000UL;
}

__STATIC_INLINE void P0_6_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x04000000UL;
}

__STATIC_INLINE void P0_6_set(void){
    PORT0->OMR = 0x00000040UL;
}

__STATIC_INLINE void P0_6_reset(void){
    PORT0->OMR = 0x00400000UL;
}

__STATIC_INLINE void P0_6_toggle(void){
    PORT0->OMR = 0x00400040UL;
}

__STATIC_INLINE uint32_t P0_6_read(void){
    return(PORT0->IN & 0x00000040UL);
}

__STATIC_INLINE void P0_6_enable_pps(void){
    PORT0->PPS |= 0x00000040UL;
}

__STATIC_INLINE void P0_6_disable_pps(void){
    PORT0->PPS &= ~0x00000040UL;
}

__STATIC_INLINE void P0_7_set_mode(uint8_t mode){
    PORT0->IOCR4 &= ~0xf8000000UL;
    PORT0->IOCR4 |= mode << 24;
}

__STATIC_INLINE void P0_7_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x0000c000UL;
    PORT0->HWSEL |= config << 14;
}

__STATIC_INLINE void P0_7_set_standard_hysteresis(){
    PORT0->PHCR0 &= ~0x40000000UL;
}

__STATIC_INLINE void P0_7_set_large_hysteresis(){
    PORT0->PHCR0 |= 0x40000000UL;
}

__STATIC_INLINE void P0_7_set(void){
    PORT0->OMR = 0x00000080UL;
}

__STATIC_INLINE void P0_7_reset(void){
    PORT0->OMR = 0x00800000UL;
}

__STATIC_INLINE void P0_7_toggle(void){
    PORT0->OMR = 0x00800080UL;
}

__STATIC_INLINE uint32_t P0_7_read(void){
    return(PORT0->IN & 0x00000080UL);
}

__STATIC_INLINE void P0_7_enable_pps(void){
    PORT0->PPS |= 0x00000080UL;
}

__STATIC_INLINE void P0_7_disable_pps(void){
    PORT0->PPS &= ~0x00000080UL;
}

__STATIC_INLINE void P0_8_set_mode(uint8_t mode){
    PORT0->IOCR8 &= ~0x000000f8UL;
    PORT0->IOCR8 |= mode << 0;
}

__STATIC_INLINE void P0_8_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00030000UL;
    PORT0->HWSEL |= config << 16;
}

__STATIC_INLINE void P0_8_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00000004UL;
}

__STATIC_INLINE void P0_8_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00000004UL;
}

__STATIC_INLINE void P0_8_set(void){
    PORT0->OMR = 0x00000100UL;
}

__STATIC_INLINE void P0_8_reset(void){
    PORT0->OMR = 0x01000000UL;
}

__STATIC_INLINE void P0_8_toggle(void){
    PORT0->OMR = 0x01000100UL;
}

__STATIC_INLINE uint32_t P0_8_read(void){
    return(PORT0->IN & 0x00000100UL);
}

__STATIC_INLINE void P0_8_enable_pps(void){
    PORT0->PPS |= 0x00000100UL;
}

__STATIC_INLINE void P0_8_disable_pps(void){
    PORT0->PPS &= ~0x00000100UL;
}

__STATIC_INLINE void P0_9_set_mode(uint8_t mode){
    PORT0->IOCR8 &= ~0x0000f800UL;
    PORT0->IOCR8 |= mode << 8;
}

__STATIC_INLINE void P0_9_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x000c0000UL;
    PORT0->HWSEL |= config << 18;
}

__STATIC_INLINE void P0_9_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00000040UL;
}

__STATIC_INLINE void P0_9_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00000040UL;
}

__STATIC_INLINE void P0_9_set(void){
    PORT0->OMR = 0x00000200UL;
}

__STATIC_INLINE void P0_9_reset(void){
    PORT0->OMR = 0x02000000UL;
}

__STATIC_INLINE void P0_9_toggle(void){
    PORT0->OMR = 0x02000200UL;
}

__STATIC_INLINE uint32_t P0_9_read(void){
    return(PORT0->IN & 0x00000200UL);
}

__STATIC_INLINE void P0_9_enable_pps(void){
    PORT0->PPS |= 0x00000200UL;
}

__STATIC_INLINE void P0_9_disable_pps(void){
    PORT0->PPS &= ~0x00000200UL;
}

__STATIC_INLINE void P0_10_set_mode(uint8_t mode){
    PORT0->IOCR8 &= ~0x00f80000UL;
    PORT0->IOCR8 |= mode << 16;
}

__STATIC_INLINE void P0_10_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00300000UL;
    PORT0->HWSEL |= config << 20;
}

__STATIC_INLINE void P0_10_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00000400UL;
}

__STATIC_INLINE void P0_10_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00000400UL;
}

__STATIC_INLINE void P0_10_set(void){
    PORT0->OMR = 0x00000400UL;
}

__STATIC_INLINE void P0_10_reset(void){
    PORT0->OMR = 0x04000000UL;
}

__STATIC_INLINE void P0_10_toggle(void){
    PORT0->OMR = 0x04000400UL;
}

__STATIC_INLINE uint32_t P0_10_read(void){
    return(PORT0->IN & 0x00000400UL);
}

__STATIC_INLINE void P0_10_enable_pps(void){
    PORT0->PPS |= 0x00000400UL;
}

__STATIC_INLINE void P0_10_disable_pps(void){
    PORT0->PPS &= ~0x00000400UL;
}

__STATIC_INLINE void P0_11_set_mode(uint8_t mode){
    PORT0->IOCR8 &= ~0xf8000000UL;
    PORT0->IOCR8 |= mode << 24;
}

__STATIC_INLINE void P0_11_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x00c00000UL;
    PORT0->HWSEL |= config << 22;
}

__STATIC_INLINE void P0_11_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00004000UL;
}

__STATIC_INLINE void P0_11_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00004000UL;
}

__STATIC_INLINE void P0_11_set(void){
    PORT0->OMR = 0x00000800UL;
}

__STATIC_INLINE void P0_11_reset(void){
    PORT0->OMR = 0x08000000UL;
}

__STATIC_INLINE void P0_11_toggle(void){
    PORT0->OMR = 0x08000800UL;
}

__STATIC_INLINE uint32_t P0_11_read(void){
    return(PORT0->IN & 0x00000800UL);
}

__STATIC_INLINE void P0_11_enable_pps(void){
    PORT0->PPS |= 0x00000800UL;
}

__STATIC_INLINE void P0_11_disable_pps(void){
    PORT0->PPS &= ~0x00000800UL;
}

__STATIC_INLINE void P0_12_set_mode(uint8_t mode){
    PORT0->IOCR12 &= ~0x000000f8UL;
    PORT0->IOCR12 |= mode << 0;
}

__STATIC_INLINE void P0_12_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x03000000UL;
    PORT0->HWSEL |= config << 24;
}

__STATIC_INLINE void P0_12_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00040000UL;
}

__STATIC_INLINE void P0_12_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00040000UL;
}

__STATIC_INLINE void P0_12_set(void){
    PORT0->OMR = 0x00001000UL;
}

__STATIC_INLINE void P0_12_reset(void){
    PORT0->OMR = 0x10000000UL;
}

__STATIC_INLINE void P0_12_toggle(void){
    PORT0->OMR = 0x10001000UL;
}

__STATIC_INLINE uint32_t P0_12_read(void){
    return(PORT0->IN & 0x00001000UL);
}

__STATIC_INLINE void P0_12_enable_pps(void){
    PORT0->PPS |= 0x00001000UL;
}

__STATIC_INLINE void P0_12_disable_pps(void){
    PORT0->PPS &= ~0x00001000UL;
}

