YueDaoWenzz/PMSM-HallFOC/XMC4700HallFOC/MCUInit/gpio_xmc1300_tssop38.h
__STATIC_INLINE void P0_13_set_mode(uint8_t mode){
    PORT0->IOCR12 &= ~0x0000f800UL;
    PORT0->IOCR12 |= mode << 8;
}

__STATIC_INLINE void P0_13_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x0c000000UL;
    PORT0->HWSEL |= config << 26;
}

__STATIC_INLINE void P0_13_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x00400000UL;
}

__STATIC_INLINE void P0_13_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x00400000UL;
}

__STATIC_INLINE void P0_13_set(void){
    PORT0->OMR = 0x00002000UL;
}

__STATIC_INLINE void P0_13_reset(void){
    PORT0->OMR = 0x20000000UL;
}

__STATIC_INLINE void P0_13_toggle(void){
    PORT0->OMR = 0x20002000UL;
}

__STATIC_INLINE uint32_t P0_13_read(void){
    return(PORT0->IN & 0x00002000UL);
}

__STATIC_INLINE void P0_13_enable_pps(void){
    PORT0->PPS |= 0x00002000UL;
}

__STATIC_INLINE void P0_13_disable_pps(void){
    PORT0->PPS &= ~0x00002000UL;
}

__STATIC_INLINE void P0_14_set_mode(uint8_t mode){
    PORT0->IOCR12 &= ~0x00f80000UL;
    PORT0->IOCR12 |= mode << 16;
}

__STATIC_INLINE void P0_14_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0x30000000UL;
    PORT0->HWSEL |= config << 28;
}

__STATIC_INLINE void P0_14_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x04000000UL;
}

__STATIC_INLINE void P0_14_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x04000000UL;
}

__STATIC_INLINE void P0_14_set(void){
    PORT0->OMR = 0x00004000UL;
}

__STATIC_INLINE void P0_14_reset(void){
    PORT0->OMR = 0x40000000UL;
}

__STATIC_INLINE void P0_14_toggle(void){
    PORT0->OMR = 0x40004000UL;
}

__STATIC_INLINE uint32_t P0_14_read(void){
    return(PORT0->IN & 0x00004000UL);
}

__STATIC_INLINE void P0_14_enable_pps(void){
    PORT0->PPS |= 0x00004000UL;
}

__STATIC_INLINE void P0_14_disable_pps(void){
    PORT0->PPS &= ~0x00004000UL;
}

__STATIC_INLINE void P0_15_set_mode(uint8_t mode){
    PORT0->IOCR12 &= ~0xf8000000UL;
    PORT0->IOCR12 |= mode << 24;
}

__STATIC_INLINE void P0_15_set_hwsel(uint32_t config){
    PORT0->HWSEL &= ~0xc0000000UL;
    PORT0->HWSEL |= config << 30;
}

__STATIC_INLINE void P0_15_set_standard_hysteresis(){
    PORT0->PHCR1 &= ~0x40000000UL;
}

__STATIC_INLINE void P0_15_set_large_hysteresis(){
    PORT0->PHCR1 |= 0x40000000UL;
}

__STATIC_INLINE void P0_15_set(void){
    PORT0->OMR = 0x00008000UL;
}

__STATIC_INLINE void P0_15_reset(void){
    PORT0->OMR = 0x80000000UL;
}

__STATIC_INLINE void P0_15_toggle(void){
    PORT0->OMR = 0x80008000UL;
}

__STATIC_INLINE uint32_t P0_15_read(void){
    return(PORT0->IN & 0x00008000UL);
}

__STATIC_INLINE void P0_15_enable_pps(void){
    PORT0->PPS |= 0x00008000UL;
}

__STATIC_INLINE void P0_15_disable_pps(void){
    PORT0->PPS &= ~0x00008000UL;
}

__STATIC_INLINE void P1_0_set_mode(uint8_t mode){
    PORT1->IOCR0 &= ~0x000000f8UL;
    PORT1->IOCR0 |= mode << 0;
}

__STATIC_INLINE void P1_0_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x00000003UL;
    PORT1->HWSEL |= config << 0;
}

__STATIC_INLINE void P1_0_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00000004UL;
}

__STATIC_INLINE void P1_0_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00000004UL;
}

__STATIC_INLINE void P1_0_set(void){
    PORT1->OMR = 0x00000001UL;
}

__STATIC_INLINE void P1_0_reset(void){
    PORT1->OMR = 0x00010000UL;
}

__STATIC_INLINE void P1_0_toggle(void){
    PORT1->OMR = 0x00010001UL;
}

__STATIC_INLINE uint32_t P1_0_read(void){
    return(PORT1->IN & 0x00000001UL);
}

__STATIC_INLINE void P1_0_enable_pps(void){
    PORT1->PPS |= 0x00000001UL;
}

__STATIC_INLINE void P1_0_disable_pps(void){
    PORT1->PPS &= ~0x00000001UL;
}

__STATIC_INLINE void P1_1_set_mode(uint8_t mode){
    PORT1->IOCR0 &= ~0x0000f800UL;
    PORT1->IOCR0 |= mode << 8;
}

__STATIC_INLINE void P1_1_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x0000000cUL;
    PORT1->HWSEL |= config << 2;
}

__STATIC_INLINE void P1_1_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00000040UL;
}

__STATIC_INLINE void P1_1_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00000040UL;
}

__STATIC_INLINE void P1_1_set(void){
    PORT1->OMR = 0x00000002UL;
}

__STATIC_INLINE void P1_1_reset(void){
    PORT1->OMR = 0x00020000UL;
}

__STATIC_INLINE void P1_1_toggle(void){
    PORT1->OMR = 0x00020002UL;
}

__STATIC_INLINE uint32_t P1_1_read(void){
    return(PORT1->IN & 0x00000002UL);
}

__STATIC_INLINE void P1_1_enable_pps(void){
    PORT1->PPS |= 0x00000002UL;
}

__STATIC_INLINE void P1_1_disable_pps(void){
    PORT1->PPS &= ~0x00000002UL;
}

__STATIC_INLINE void P1_2_set_mode(uint8_t mode){
    PORT1->IOCR0 &= ~0x00f80000UL;
    PORT1->IOCR0 |= mode << 16;
}

__STATIC_INLINE void P1_2_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x00000030UL;
    PORT1->HWSEL |= config << 4;
}

__STATIC_INLINE void P1_2_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00000400UL;
}

__STATIC_INLINE void P1_2_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00000400UL;
}

__STATIC_INLINE void P1_2_set(void){
    PORT1->OMR = 0x00000004UL;
}

__STATIC_INLINE void P1_2_reset(void){
    PORT1->OMR = 0x00040000UL;
}

__STATIC_INLINE void P1_2_toggle(void){
    PORT1->OMR = 0x00040004UL;
}

__STATIC_INLINE uint32_t P1_2_read(void){
    return(PORT1->IN & 0x00000004UL);
}

__STATIC_INLINE void P1_2_enable_pps(void){
    PORT1->PPS |= 0x00000004UL;
}

__STATIC_INLINE void P1_2_disable_pps(void){
    PORT1->PPS &= ~0x00000004UL;
}

__STATIC_INLINE void P1_3_set_mode(uint8_t mode){
    PORT1->IOCR0 &= ~0xf8000000UL;
    PORT1->IOCR0 |= mode << 24;
}

__STATIC_INLINE void P1_3_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x000000c0UL;
    PORT1->HWSEL |= config << 6;
}

__STATIC_INLINE void P1_3_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00004000UL;
}

__STATIC_INLINE void P1_3_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00004000UL;
}

__STATIC_INLINE void P1_3_set(void){
    PORT1->OMR = 0x00000008UL;
}

__STATIC_INLINE void P1_3_reset(void){
    PORT1->OMR = 0x00080000UL;
}

__STATIC_INLINE void P1_3_toggle(void){
    PORT1->OMR = 0x00080008UL;
}

__STATIC_INLINE uint32_t P1_3_read(void){
    return(PORT1->IN & 0x00000008UL);
}

__STATIC_INLINE void P1_3_enable_pps(void){
    PORT1->PPS |= 0x00000008UL;
}

__STATIC_INLINE void P1_3_disable_pps(void){
    PORT1->PPS &= ~0x00000008UL;
}

__STATIC_INLINE void P1_4_set_mode(uint8_t mode){
    PORT1->IOCR4 &= ~0x000000f8UL;
    PORT1->IOCR4 |= mode << 0;
}

