YueDaoWenzz/PMSM-HallFOC/XMC4700HallFOC/MCUInit/gpio_xmc1300_tssop38.h
__STATIC_INLINE void P1_4_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x00000300UL;
    PORT1->HWSEL |= config << 8;
}

__STATIC_INLINE void P1_4_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00040000UL;
}

__STATIC_INLINE void P1_4_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00040000UL;
}

__STATIC_INLINE void P1_4_set(void){
    PORT1->OMR = 0x00000010UL;
}

__STATIC_INLINE void P1_4_reset(void){
    PORT1->OMR = 0x00100000UL;
}

__STATIC_INLINE void P1_4_toggle(void){
    PORT1->OMR = 0x00100010UL;
}

__STATIC_INLINE uint32_t P1_4_read(void){
    return(PORT1->IN & 0x00000010UL);
}

__STATIC_INLINE void P1_4_enable_pps(void){
    PORT1->PPS |= 0x00000010UL;
}

__STATIC_INLINE void P1_4_disable_pps(void){
    PORT1->PPS &= ~0x00000010UL;
}

__STATIC_INLINE void P1_5_set_mode(uint8_t mode){
    PORT1->IOCR4 &= ~0x0000f800UL;
    PORT1->IOCR4 |= mode << 8;
}

__STATIC_INLINE void P1_5_set_hwsel(uint32_t config){
    PORT1->HWSEL &= ~0x00000c00UL;
    PORT1->HWSEL |= config << 10;
}

__STATIC_INLINE void P1_5_set_standard_hysteresis(){
    PORT1->PHCR0 &= ~0x00400000UL;
}

__STATIC_INLINE void P1_5_set_large_hysteresis(){
    PORT1->PHCR0 |= 0x00400000UL;
}

__STATIC_INLINE void P1_5_set(void){
    PORT1->OMR = 0x00000020UL;
}

__STATIC_INLINE void P1_5_reset(void){
    PORT1->OMR = 0x00200000UL;
}

__STATIC_INLINE void P1_5_toggle(void){
    PORT1->OMR = 0x00200020UL;
}

__STATIC_INLINE uint32_t P1_5_read(void){
    return(PORT1->IN & 0x00000020UL);
}

__STATIC_INLINE void P1_5_enable_pps(void){
    PORT1->PPS |= 0x00000020UL;
}

__STATIC_INLINE void P1_5_disable_pps(void){
    PORT1->PPS &= ~0x00000020UL;
}

__STATIC_INLINE void P2_0_set_mode(uint8_t mode){
    PORT2->IOCR0 &= ~0x000000f8UL;
    PORT2->IOCR0 |= mode << 0;
}

__STATIC_INLINE void P2_0_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00000003UL;
    PORT2->HWSEL |= config << 0;
}

__STATIC_INLINE void P2_0_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00000004UL;
}

__STATIC_INLINE void P2_0_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00000004UL;
}

__STATIC_INLINE void P2_0_enable_digital(void){
    PORT2->PDISC &= ~0x00000001UL;
}

__STATIC_INLINE void P2_0_disable_digital(void){
    PORT2->PDISC |= 0x00000001UL;
}

__STATIC_INLINE void P2_0_set(void){
    PORT2->OMR = 0x00000001UL;
}

__STATIC_INLINE void P2_0_reset(void){
    PORT2->OMR = 0x00010000UL;
}

__STATIC_INLINE void P2_0_toggle(void){
    PORT2->OMR = 0x00010001UL;
}

__STATIC_INLINE uint32_t P2_0_read(void){
    return(PORT2->IN & 0x00000001UL);
}

__STATIC_INLINE void P2_0_enable_pps(void){
    PORT2->PPS |= 0x00000001UL;
}

__STATIC_INLINE void P2_0_disable_pps(void){
    PORT2->PPS &= ~0x00000001UL;
}

__STATIC_INLINE void P2_1_set_mode(uint8_t mode){
    PORT2->IOCR0 &= ~0x0000f800UL;
    PORT2->IOCR0 |= mode << 8;
}

__STATIC_INLINE void P2_1_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x0000000cUL;
    PORT2->HWSEL |= config << 2;
}

__STATIC_INLINE void P2_1_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00000040UL;
}

__STATIC_INLINE void P2_1_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00000040UL;
}

__STATIC_INLINE void P2_1_enable_digital(void){
    PORT2->PDISC &= ~0x00000002UL;
}

__STATIC_INLINE void P2_1_disable_digital(void){
    PORT2->PDISC |= 0x00000002UL;
}

__STATIC_INLINE void P2_1_set(void){
    PORT2->OMR = 0x00000002UL;
}

__STATIC_INLINE void P2_1_reset(void){
    PORT2->OMR = 0x00020000UL;
}

__STATIC_INLINE void P2_1_toggle(void){
    PORT2->OMR = 0x00020002UL;
}

__STATIC_INLINE uint32_t P2_1_read(void){
    return(PORT2->IN & 0x00000002UL);
}

__STATIC_INLINE void P2_1_enable_pps(void){
    PORT2->PPS |= 0x00000002UL;
}

__STATIC_INLINE void P2_1_disable_pps(void){
    PORT2->PPS &= ~0x00000002UL;
}

__STATIC_INLINE void P2_2_set_mode(uint8_t mode){
    PORT2->IOCR0 &= ~0x00f80000UL;
    PORT2->IOCR0 |= mode << 16;
}

__STATIC_INLINE void P2_2_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00000030UL;
    PORT2->HWSEL |= config << 4;
}

__STATIC_INLINE void P2_2_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00000400UL;
}

__STATIC_INLINE void P2_2_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00000400UL;
}

__STATIC_INLINE void P2_2_enable_digital(void){
    PORT2->PDISC &= ~0x00000004UL;
}

__STATIC_INLINE void P2_2_disable_digital(void){
    PORT2->PDISC |= 0x00000004UL;
}

__STATIC_INLINE void P2_2_set(void){
    PORT2->OMR = 0x00000004UL;
}

__STATIC_INLINE void P2_2_reset(void){
    PORT2->OMR = 0x00040000UL;
}

__STATIC_INLINE void P2_2_toggle(void){
    PORT2->OMR = 0x00040004UL;
}

__STATIC_INLINE uint32_t P2_2_read(void){
    return(PORT2->IN & 0x00000004UL);
}

__STATIC_INLINE void P2_2_enable_pps(void){
    PORT2->PPS |= 0x00000004UL;
}

__STATIC_INLINE void P2_2_disable_pps(void){
    PORT2->PPS &= ~0x00000004UL;
}

__STATIC_INLINE void P2_3_set_mode(uint8_t mode){
    PORT2->IOCR0 &= ~0xf8000000UL;
    PORT2->IOCR0 |= mode << 24;
}

__STATIC_INLINE void P2_3_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x000000c0UL;
    PORT2->HWSEL |= config << 6;
}

__STATIC_INLINE void P2_3_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00004000UL;
}

__STATIC_INLINE void P2_3_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00004000UL;
}

__STATIC_INLINE void P2_3_enable_digital(void){
    PORT2->PDISC &= ~0x00000008UL;
}

__STATIC_INLINE void P2_3_disable_digital(void){
    PORT2->PDISC |= 0x00000008UL;
}

__STATIC_INLINE void P2_3_set(void){
    PORT2->OMR = 0x00000008UL;
}

__STATIC_INLINE void P2_3_reset(void){
    PORT2->OMR = 0x00080000UL;
}

__STATIC_INLINE void P2_3_toggle(void){
    PORT2->OMR = 0x00080008UL;
}

__STATIC_INLINE uint32_t P2_3_read(void){
    return(PORT2->IN & 0x00000008UL);
}

__STATIC_INLINE void P2_3_enable_pps(void){
    PORT2->PPS |= 0x00000008UL;
}

__STATIC_INLINE void P2_3_disable_pps(void){
    PORT2->PPS &= ~0x00000008UL;
}

__STATIC_INLINE void P2_4_set_mode(uint8_t mode){
    PORT2->IOCR4 &= ~0x000000f8UL;
    PORT2->IOCR4 |= mode << 0;
}

__STATIC_INLINE void P2_4_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00000300UL;
    PORT2->HWSEL |= config << 8;
}

