YueDaoWenzz/PMSM-HallFOC/XMC4700HallFOC/MCUInit/gpio_xmc1300_tssop38.h
__STATIC_INLINE void P2_4_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00040000UL;
}

__STATIC_INLINE void P2_4_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00040000UL;
}

__STATIC_INLINE void P2_4_enable_digital(void){
    PORT2->PDISC &= ~0x00000010UL;
}

__STATIC_INLINE void P2_4_disable_digital(void){
    PORT2->PDISC |= 0x00000010UL;
}

__STATIC_INLINE void P2_4_set(void){
    PORT2->OMR = 0x00000010UL;
}

__STATIC_INLINE void P2_4_reset(void){
    PORT2->OMR = 0x00100000UL;
}

__STATIC_INLINE void P2_4_toggle(void){
    PORT2->OMR = 0x00100010UL;
}

__STATIC_INLINE uint32_t P2_4_read(void){
    return(PORT2->IN & 0x00000010UL);
}

__STATIC_INLINE void P2_4_enable_pps(void){
    PORT2->PPS |= 0x00000010UL;
}

__STATIC_INLINE void P2_4_disable_pps(void){
    PORT2->PPS &= ~0x00000010UL;
}

__STATIC_INLINE void P2_5_set_mode(uint8_t mode){
    PORT2->IOCR4 &= ~0x0000f800UL;
    PORT2->IOCR4 |= mode << 8;
}

__STATIC_INLINE void P2_5_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00000c00UL;
    PORT2->HWSEL |= config << 10;
}

__STATIC_INLINE void P2_5_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x00400000UL;
}

__STATIC_INLINE void P2_5_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x00400000UL;
}

__STATIC_INLINE void P2_5_enable_digital(void){
    PORT2->PDISC &= ~0x00000020UL;
}

__STATIC_INLINE void P2_5_disable_digital(void){
    PORT2->PDISC |= 0x00000020UL;
}

__STATIC_INLINE void P2_5_set(void){
    PORT2->OMR = 0x00000020UL;
}

__STATIC_INLINE void P2_5_reset(void){
    PORT2->OMR = 0x00200000UL;
}

__STATIC_INLINE void P2_5_toggle(void){
    PORT2->OMR = 0x00200020UL;
}

__STATIC_INLINE uint32_t P2_5_read(void){
    return(PORT2->IN & 0x00000020UL);
}

__STATIC_INLINE void P2_5_enable_pps(void){
    PORT2->PPS |= 0x00000020UL;
}

__STATIC_INLINE void P2_5_disable_pps(void){
    PORT2->PPS &= ~0x00000020UL;
}

__STATIC_INLINE void P2_6_set_mode(uint8_t mode){
    PORT2->IOCR4 &= ~0x00f80000UL;
    PORT2->IOCR4 |= mode << 16;
}

__STATIC_INLINE void P2_6_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00003000UL;
    PORT2->HWSEL |= config << 12;
}

__STATIC_INLINE void P2_6_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x04000000UL;
}

__STATIC_INLINE void P2_6_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x04000000UL;
}

__STATIC_INLINE void P2_6_enable_digital(void){
    PORT2->PDISC &= ~0x00000040UL;
}

__STATIC_INLINE void P2_6_disable_digital(void){
    PORT2->PDISC |= 0x00000040UL;
}

__STATIC_INLINE void P2_6_set(void){
    PORT2->OMR = 0x00000040UL;
}

__STATIC_INLINE void P2_6_reset(void){
    PORT2->OMR = 0x00400000UL;
}

__STATIC_INLINE void P2_6_toggle(void){
    PORT2->OMR = 0x00400040UL;
}

__STATIC_INLINE uint32_t P2_6_read(void){
    return(PORT2->IN & 0x00000040UL);
}

__STATIC_INLINE void P2_6_enable_pps(void){
    PORT2->PPS |= 0x00000040UL;
}

__STATIC_INLINE void P2_6_disable_pps(void){
    PORT2->PPS &= ~0x00000040UL;
}

__STATIC_INLINE void P2_7_set_mode(uint8_t mode){
    PORT2->IOCR4 &= ~0xf8000000UL;
    PORT2->IOCR4 |= mode << 24;
}

__STATIC_INLINE void P2_7_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x0000c000UL;
    PORT2->HWSEL |= config << 14;
}

__STATIC_INLINE void P2_7_set_standard_hysteresis(){
    PORT2->PHCR0 &= ~0x40000000UL;
}

__STATIC_INLINE void P2_7_set_large_hysteresis(){
    PORT2->PHCR0 |= 0x40000000UL;
}

__STATIC_INLINE void P2_7_enable_digital(void){
    PORT2->PDISC &= ~0x00000080UL;
}

__STATIC_INLINE void P2_7_disable_digital(void){
    PORT2->PDISC |= 0x00000080UL;
}

__STATIC_INLINE void P2_7_set(void){
    PORT2->OMR = 0x00000080UL;
}

__STATIC_INLINE void P2_7_reset(void){
    PORT2->OMR = 0x00800000UL;
}

__STATIC_INLINE void P2_7_toggle(void){
    PORT2->OMR = 0x00800080UL;
}

__STATIC_INLINE uint32_t P2_7_read(void){
    return(PORT2->IN & 0x00000080UL);
}

__STATIC_INLINE void P2_7_enable_pps(void){
    PORT2->PPS |= 0x00000080UL;
}

__STATIC_INLINE void P2_7_disable_pps(void){
    PORT2->PPS &= ~0x00000080UL;
}

__STATIC_INLINE void P2_8_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0x000000f8UL;
    PORT2->IOCR8 |= mode << 0;
}

__STATIC_INLINE void P2_8_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00030000UL;
    PORT2->HWSEL |= config << 16;
}

__STATIC_INLINE void P2_8_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00000004UL;
}

__STATIC_INLINE void P2_8_set_large_hysteresis(){
    PORT2->PHCR1 |= 0x00000004UL;
}

__STATIC_INLINE void P2_8_enable_digital(void){
    PORT2->PDISC &= ~0x00000100UL;
}

__STATIC_INLINE void P2_8_disable_digital(void){
    PORT2->PDISC |= 0x00000100UL;
}

__STATIC_INLINE void P2_8_set(void){
    PORT2->OMR = 0x00000100UL;
}

__STATIC_INLINE void P2_8_reset(void){
    PORT2->OMR = 0x01000000UL;
}

__STATIC_INLINE void P2_8_toggle(void){
    PORT2->OMR = 0x01000100UL;
}

__STATIC_INLINE uint32_t P2_8_read(void){
    return(PORT2->IN & 0x00000100UL);
}

__STATIC_INLINE void P2_8_enable_pps(void){
    PORT2->PPS |= 0x00000100UL;
}

__STATIC_INLINE void P2_8_disable_pps(void){
    PORT2->PPS &= ~0x00000100UL;
}

__STATIC_INLINE void P2_9_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0x0000f800UL;
    PORT2->IOCR8 |= mode << 8;
}

__STATIC_INLINE void P2_9_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x000c0000UL;
    PORT2->HWSEL |= config << 18;
}

__STATIC_INLINE void P2_9_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00000040UL;
}

__STATIC_INLINE void P2_9_set_large_hysteresis(){
    PORT2->PHCR1 |= 0x00000040UL;
}

__STATIC_INLINE void P2_9_enable_digital(void){
    PORT2->PDISC &= ~0x00000200UL;
}

__STATIC_INLINE void P2_9_disable_digital(void){
    PORT2->PDISC |= 0x00000200UL;
}

__STATIC_INLINE void P2_9_set(void){
    PORT2->OMR = 0x00000200UL;
}

__STATIC_INLINE void P2_9_reset(void){
    PORT2->OMR = 0x02000000UL;
}

__STATIC_INLINE void P2_9_toggle(void){
    PORT2->OMR = 0x02000200UL;
}

__STATIC_INLINE uint32_t P2_9_read(void){
    return(PORT2->IN & 0x00000200UL);
}

__STATIC_INLINE void P2_9_enable_pps(void){
    PORT2->PPS |= 0x00000200UL;
}

__STATIC_INLINE void P2_9_disable_pps(void){
    PORT2->PPS &= ~0x00000200UL;
}

__STATIC_INLINE void P2_10_set_mode(uint8_t mode){
    PORT2->IOCR8 &= ~0x00f80000UL;
    PORT2->IOCR8 |= mode << 16;
}

__STATIC_INLINE void P2_10_set_hwsel(uint32_t config){
    PORT2->HWSEL &= ~0x00300000UL;
    PORT2->HWSEL |= config << 20;
}

__STATIC_INLINE void P2_10_set_standard_hysteresis(){
    PORT2->PHCR1 &= ~0x00000400UL;
}

